In [1]:
import pandas as pd

In [2]:
#1. Load the dataset into a Pandas DataFrame.

df = pd.read_csv("Downloads/edtech_student_learning_data.csv")

In [3]:
#2. Display the first 10 records of the dataset.

df.head(10)

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
5,1006,Student_6,Female,Pune,2024-09-18,Generative AI,Weekend,120,79,64,98,57,2.6,30,Placed,6,65.83,305730.0
6,1007,Student_7,Male,Mumbai,2024-02-22,Data Analytics,Weekend,120,112,93,89,94,3.2,29,Placed,6,93.33,707137.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.3,14,Placed,6,90.83,1053790.0
8,1009,Student_9,Male,Mumbai,2024-05-05,AI & ML,Weekend,120,83,75,61,96,2.6,19,Placed,8,69.17,502210.0
9,1010,Student_10,Female,Delhi,2024-08-22,Data Analytics,Weekday,120,118,70,50,89,4.2,26,Not Placed,8,98.33,NaN

In [4]:
#3. Display the last 5 records of the dataset.

df.tail()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
500,1452,Student_452,Female,Mumbai,2024-03-07,Generative AI,Weekday,120,68,84,84,58,2.2,19,Not Placed,8,56.67,NaN
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN
502,1210,Student_210,Male,Bangalore,2024-04-04,AI & ML,Weekday,120,75,40,84,77,2.4,19,Placed,5,62.50,750043.0
503,1178,Student_178,Male,Delhi,2024-01-20,Generative AI,Weekday,120,80,97,92,66,4.7,33,Placed,5,66.67,890611.0
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.6,25,Placed,7,84.17,1003022.0

In [5]:
#4. Check the shape of the dataset.

df.shape

(505, 18)

In [6]:
#5. Display all column names along with their data types.

df.dtypes

student_id             int64
student_name          object
gender                object
city                  object
enrollment_date       object
course                object
batch_type            object
total_sessions         int64
sessions_attended      int64
avg_quiz_score         int64
assignment_score       int64
project_score          int64
final_rating         float64
learning_hours         int64
placement_status      object
feedback_score         int64
attendance_pct       float64
salary_offered       float64
dtype: object

In [7]:
#6. Generate summary statistics for all numerical columns.

df.describe()

,student_id,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,feedback_score,attendance_pct,salary_offered
count,505.000000,505.0,505.000000,505.000000,505.000000,505.000000,477.000000,505.000000,505.000000,505.000000,3.360000e+02
mean,1251.015842,120.0,88.102970,69.601980,71.984158,75.287129,3.535220,22.128713,7.041584,73.419149,7.701324e+05
std,144.242011,0.0,17.087232,17.137226,15.777337,14.678794,0.862365,9.924180,1.370122,14.239418,2.656396e+05
min,1001.000000,120.0,60.000000,40.000000,45.000000,50.000000,2.000000,5.000000,5.000000,50.000000,3.005150e+05
25%,1127.000000,120.0,73.000000,56.000000,58.000000,62.000000,2.800000,14.000000,6.000000,60.830000,5.442040e+05
50%,1251.000000,120.0,88.000000,69.000000,72.000000,76.000000,3.600000,23.000000,7.000000,73.330000,7.788115e+05
75%,1376.000000,120.0,103.000000,84.000000,86.000000,88.000000,4.300000,31.000000,8.000000,85.830000,1.003022e+06
max,1500.000000,120.0,119.000000,99.000000,99.000000,99.000000,5.000000,39.000000,9.000000,99.170000,1.199092e+06

In [8]:
#7. Identify columns that contain missing values.

df.isna().sum()

student_id             0
student_name           0
gender                 0
city                   0
enrollment_date        0
course                 0
batch_type             0
total_sessions         0
sessions_attended      0
avg_quiz_score         0
assignment_score       0
project_score          0
final_rating          28
learning_hours         0
placement_status       0
feedback_score         0
attendance_pct         0
salary_offered       169
dtype: int64

In [9]:
#8. Count the number of missing values in each column.

df.isna().sum()

student_id             0
student_name           0
gender                 0
city                   0
enrollment_date        0
course                 0
batch_type             0
total_sessions         0
sessions_attended      0
avg_quiz_score         0
assignment_score       0
project_score          0
final_rating          28
learning_hours         0
placement_status       0
feedback_score         0
attendance_pct         0
salary_offered       169
dtype: int64

In [10]:
#9. Calculate the percentage of missing values in the final_rating column

print(df['final_rating'].isnull().sum()/len(df) * 100)

5.544554455445545

In [11]:
#10. Fill missing values in the final_rating column using the mean.

df["final_rating"].fillna(df["final_rating"].mean(), inplace=True)

C:\Users\Dell\AppData\Local\Temp\ipykernel_8840\2269581740.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["final_rating"].fillna(df["final_rating"].mean(), inplace=True)

In [12]:
#11. Verify that missing values in final_rating are handled.

df.isna().sum()

student_id             0
student_name           0
gender                 0
city                   0
enrollment_date        0
course                 0
batch_type             0
total_sessions         0
sessions_attended      0
avg_quiz_score         0
assignment_score       0
project_score          0
final_rating           0
learning_hours         0
placement_status       0
feedback_score         0
attendance_pct         0
salary_offered       169
dtype: int64

In [13]:
#12. Check whether duplicate records exist in the dataset.

df.duplicated().sum()

5

In [14]:
#13. Count the total number of duplicate rows

df.duplicated().sum()

5

In [15]:
#14. Display all duplicate records

df[df.duplicated()]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
500,1452,Student_452,Female,Mumbai,2024-03-07,Generative AI,Weekday,120,68,84,84,58,2.2,19,Not Placed,8,56.67,NaN
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN
502,1210,Student_210,Male,Bangalore,2024-04-04,AI & ML,Weekday,120,75,40,84,77,2.4,19,Placed,5,62.50,750043.0
503,1178,Student_178,Male,Delhi,2024-01-20,Generative AI,Weekday,120,80,97,92,66,4.7,33,Placed,5,66.67,890611.0
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.6,25,Placed,7,84.17,1003022.0

In [16]:
#15. Remove duplicate records from the dataset

df.drop_duplicates(inplace=True)

In [17]:
#16. Verify the dataset size after removing duplicates.

df.shape

(500, 18)

In [18]:
#17. Find the number of unique values in the city column.

df["city"].nunique()

6

In [19]:
#18. Find the number of unique values in the course column

df["course"].nunique()

4

In [20]:
#19. Display all unique cities present in the dataset.

df["city"].unique()

array(['Hyderabad', 'Pune', 'Delhi', 'Mumbai', 'Chennai', 'Bangalore'],
      dtype=object)

In [21]:
#20. Count the number of students in each city

df["city"].value_counts()

city
Hyderabad    99
Mumbai       93
Pune         87
Bangalore    81
Chennai      73
Delhi        67
Name: count, dtype: int64

In [22]:
#21. Count the number of students enrolled in each course.

df["course"].value_counts()

course
Data Analytics    143
Data Science      128
AI & ML           125
Generative AI     104
Name: count, dtype: int64

In [99]:
#22. Identify the course with the highest student enrollment.

df['course'].value_counts().sort_values(ascending=False).head(1)

course
Data Analytics    143
Name: count, dtype: int64

In [24]:
#23. Count the number of students who are placed and not placed.

df["placement_status"].value_counts()

placement_status
Placed        333
Not Placed    167
Name: count, dtype: int64

In [25]:
#24. Filter students whose attendance percentage is greater than 80

df[df["attendance_pct"] > 80]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
6,1007,Student_7,Male,Mumbai,2024-02-22,Data Analytics,Weekend,120,112,93,89,94,3.2,29,Placed,6,93.33,707137.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.3,14,Placed,6,90.83,1053790.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
474,1475,Student_475,Male,Delhi,2024-04-21,Data Science,Weekend,120,101,99,85,83,2.6,12,Placed,8,84.17,471349.0
475,1476,Student_476,Female,Chennai,2024-02-05,Data Analytics,Weekday,120,97,99,99,94,3.6,33,Placed,9,80.83,855839.0
477,1478,Student_478,Female,Mumbai,2024-07-06,AI & ML,Weekend,120,104,88,73,87,3.8,14,Placed,5,86.67,749813.0
481,1482,Student_482,Female,Mumbai,2024-07-15,Generative AI,Weekend,120,101,63,56,66,3.6,30,Placed,9,84.17,309637.0
488,1489,Student_489,Male,Chennai,2024-10-19,Generative AI,Weekend,120,111,70,49,75,3.3,26,Not Placed,7,92.50,NaN

In [26]:
#25. Filter students who attended fewer than 70 sessions.

df[df["sessions_attended"] < 70]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
34,1035,Student_35,Female,Hyderabad,2024-06-18,Data Analytics,Weekday,120,67,51,89,71,4.1,19,Not Placed,5,55.83,NaN
37,1038,Student_38,Male,Chennai,2024-11-21,Data Analytics,Weekend,120,60,67,89,73,3.7,13,Placed,6,50.00,1016118.0
39,1040,Student_40,Male,Bangalore,2024-05-12,Data Science,Weekday,120,67,70,97,76,3.0,30,Not Placed,9,55.83,NaN
43,1044,Student_44,Female,Mumbai,2024-02-15,Data Science,Weekend,120,64,68,90,72,4.5,24,Not Placed,7,53.33,NaN
48,1049,Student_49,Female,Chennai,2024-03-13,Data Science,Weekend,120,60,82,81,67,4.7,38,Not Placed,5,50.00,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
485,1486,Student_486,Female,Mumbai,2024-04-28,AI & ML,Weekday,120,62,97,94,87,2.5,22,Placed,5,51.67,716704.0
487,1488,Student_488,Female,Pune,2024-09-17,Data Science,Weekday,120,66,92,65,51,2.2,27,Placed,7,55.00,797760.0
490,1491,Student_491,Female,Bangalore,2024-08-09,Data Science,Weekday,120,68,58,64,96,3.4,35,Placed,6,56.67,1097955.0
494,1495,Student_495,Male,Pune,2024-12-07,AI & ML,Weekend,120,61,69,77,52,4.1,9,Placed,8,50.83,867354.0
496,1497,Student_497,Male,Hyderabad,2024-10-06,Generative AI,Weekday,120,61,88,53,72,3.7,28,Placed,5,50.83,834633.0

In [27]:
#26. Filter students with an average quiz score above 85

df[df["avg_quiz_score"] > 85]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
6,1007,Student_7,Male,Mumbai,2024-02-22,Data Analytics,Weekend,120,112,93,89,94,3.2,29,Placed,6,93.33,707137.0
14,1015,Student_15,Female,Delhi,2024-05-30,Data Analytics,Weekend,120,88,93,71,64,3.9,29,Placed,7,73.33,1128411.0
16,1017,Student_17,Female,Mumbai,2024-12-01,AI & ML,Weekend,120,98,91,50,68,3.4,5,Not Placed,9,81.67,NaN
23,1024,Student_24,Female,Hyderabad,2024-12-17,Data Science,Weekday,120,103,92,60,69,4.2,13,Not Placed,6,85.83,NaN
33,1034,Student_34,Female,Bangalore,2024-04-01,Generative AI,Weekend,120,114,99,98,52,4.3,32,Placed,6,95.00,572448.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
487,1488,Student_488,Female,Pune,2024-09-17,Data Science,Weekday,120,66,92,65,51,2.2,27,Placed,7,55.00,797760.0
491,1492,Student_492,Male,Chennai,2024-08-13,Data Analytics,Weekday,120,74,87,81,80,2.3,15,Placed,8,61.67,1155121.0
495,1496,Student_496,Male,Hyderabad,2024-12-29,Data Science,Weekday,120,86,94,97,57,3.1,14,Placed,7,71.67,572544.0
496,1497,Student_497,Male,Hyderabad,2024-10-06,Generative AI,Weekday,120,61,88,53,72,3.7,28,Placed,5,50.83,834633.0
497,1498,Student_498,Female,Bangalore,2024-03-21,Data Analytics,Weekday,120,94,94,53,63,3.4,39,Placed,7,78.33,333896.0

In [28]:
#27. Filter students enrolled in the Data Science course.

df[df["course"] == "Data Science"]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.60000,8,Placed,5,60.83,501904.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.30000,14,Placed,6,90.83,1053790.0
10,1011,Student_11,Male,Chennai,2024-02-12,Data Science,Weekday,120,102,53,48,61,4.60000,25,Not Placed,7,85.00,NaN
13,1014,Student_14,Male,Mumbai,2024-09-05,Data Science,Weekday,120,109,55,91,96,3.70000,34,Placed,6,90.83,645430.0
18,1019,Student_19,Female,Pune,2024-01-08,Data Science,Weekend,120,115,74,58,78,2.90000,11,Placed,8,95.83,1000399.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
487,1488,Student_488,Female,Pune,2024-09-17,Data Science,Weekday,120,66,92,65,51,2.20000,27,Placed,7,55.00,797760.0
489,1490,Student_490,Male,Pune,2024-09-12,Data Science,Weekend,120,73,75,92,62,4.10000,6,Placed,7,60.83,667747.0
490,1491,Student_491,Female,Bangalore,2024-08-09,Data Science,Weekday,120,68,58,64,96,3.40000,35,Placed,6,56.67,1097955.0
495,1496,Student_496,Male,Hyderabad,2024-12-29,Data Science,Weekday,120,86,94,97,57,3.10000,14,Placed,7,71.67,572544.0
498,1499,Student_499,Male,Mumbai,2024-07-20,Data Science,Weekday,120,77,72,48,76,3.53522,27,Placed,8,64.17,778646.0

In [29]:
#28. Filter students who are not placed and attended more than 75 sessions

df[(df["placement_status"] == "Not Placed") & (df["sessions_attended"] > 75)]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.50000,33,Not Placed,8,91.67,NaN
9,1010,Student_10,Female,Delhi,2024-08-22,Data Analytics,Weekday,120,118,70,50,89,4.20000,26,Not Placed,8,98.33,NaN
10,1011,Student_11,Male,Chennai,2024-02-12,Data Science,Weekday,120,102,53,48,61,4.60000,25,Not Placed,7,85.00,NaN
15,1016,Student_16,Male,Mumbai,2024-07-01,Data Analytics,Weekday,120,116,85,59,90,3.60000,32,Not Placed,7,96.67,NaN
16,1017,Student_17,Female,Mumbai,2024-12-01,AI & ML,Weekend,120,98,91,50,68,3.40000,5,Not Placed,9,81.67,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
464,1465,Student_465,Female,Chennai,2024-06-30,Data Science,Weekday,120,102,94,74,80,3.53522,24,Not Placed,9,85.00,NaN
469,1470,Student_470,Female,Hyderabad,2024-09-19,Generative AI,Weekday,120,111,73,52,52,3.60000,24,Not Placed,6,92.50,NaN
473,1474,Student_474,Female,Delhi,2024-05-26,Data Analytics,Weekend,120,108,70,66,81,3.70000,15,Not Placed,6,90.00,NaN
480,1481,Student_481,Female,Mumbai,2024-10-29,Data Science,Weekday,120,83,61,74,89,3.90000,36,Not Placed,7,69.17,NaN
488,1489,Student_489,Male,Chennai,2024-10-19,Generative AI,Weekend,120,111,70,49,75,3.30000,26,Not Placed,7,92.50,NaN

In [30]:
#29. Filter students belonging to Pune, Bangalore, or Hyderabad

df[df["city"].isin(["Pune","Bangalore","Hyderabad"])]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0
5,1006,Student_6,Female,Pune,2024-09-18,Generative AI,Weekend,120,79,64,98,57,2.6,30,Placed,6,65.83,305730.0
18,1019,Student_19,Female,Pune,2024-01-08,Data Science,Weekend,120,115,74,58,78,2.9,11,Placed,8,95.83,1000399.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
494,1495,Student_495,Male,Pune,2024-12-07,AI & ML,Weekend,120,61,69,77,52,4.1,9,Placed,8,50.83,867354.0
495,1496,Student_496,Male,Hyderabad,2024-12-29,Data Science,Weekday,120,86,94,97,57,3.1,14,Placed,7,71.67,572544.0
496,1497,Student_497,Male,Hyderabad,2024-10-06,Generative AI,Weekday,120,61,88,53,72,3.7,28,Placed,5,50.83,834633.0
497,1498,Student_498,Female,Bangalore,2024-03-21,Data Analytics,Weekday,120,94,94,53,63,3.4,39,Placed,7,78.33,333896.0
499,1500,Student_500,Female,Pune,2024-06-06,AI & ML,Weekday,120,73,57,79,78,3.8,21,Placed,7,60.83,1115331.0

In [31]:
#30. Filter students enrolled in AI & ML or Generative AI courses

df[df["course"].isin(["AI & ML","Generative AI"])]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
5,1006,Student_6,Female,Pune,2024-09-18,Generative AI,Weekend,120,79,64,98,57,2.6,30,Placed,6,65.83,305730.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
488,1489,Student_489,Male,Chennai,2024-10-19,Generative AI,Weekend,120,111,70,49,75,3.3,26,Not Placed,7,92.50,NaN
493,1494,Student_494,Female,Delhi,2024-12-20,Generative AI,Weekday,120,94,75,88,88,3.9,36,Placed,8,78.33,596618.0
494,1495,Student_495,Male,Pune,2024-12-07,AI & ML,Weekend,120,61,69,77,52,4.1,9,Placed,8,50.83,867354.0
496,1497,Student_497,Male,Hyderabad,2024-10-06,Generative AI,Weekday,120,61,88,53,72,3.7,28,Placed,5,50.83,834633.0
499,1500,Student_500,Female,Pune,2024-06-06,AI & ML,Weekday,120,73,57,79,78,3.8,21,Placed,7,60.83,1115331.0

In [32]:
#31. Filter students whose average quiz score lies between 60 and 80

df[df["avg_quiz_score"].between(60,80)]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.70000,5,Not Placed,8,59.17,NaN
5,1006,Student_6,Female,Pune,2024-09-18,Generative AI,Weekend,120,79,64,98,57,2.60000,30,Placed,6,65.83,305730.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.30000,14,Placed,6,90.83,1053790.0
8,1009,Student_9,Male,Mumbai,2024-05-05,AI & ML,Weekend,120,83,75,61,96,2.60000,19,Placed,8,69.17,502210.0
9,1010,Student_10,Female,Delhi,2024-08-22,Data Analytics,Weekday,120,118,70,50,89,4.20000,26,Not Placed,8,98.33,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
488,1489,Student_489,Male,Chennai,2024-10-19,Generative AI,Weekend,120,111,70,49,75,3.30000,26,Not Placed,7,92.50,NaN
489,1490,Student_490,Male,Pune,2024-09-12,Data Science,Weekend,120,73,75,92,62,4.10000,6,Placed,7,60.83,667747.0
493,1494,Student_494,Female,Delhi,2024-12-20,Generative AI,Weekday,120,94,75,88,88,3.90000,36,Placed,8,78.33,596618.0
494,1495,Student_495,Male,Pune,2024-12-07,AI & ML,Weekend,120,61,69,77,52,4.10000,9,Placed,8,50.83,867354.0
498,1499,Student_499,Male,Mumbai,2024-07-20,Data Science,Weekday,120,77,72,48,76,3.53522,27,Placed,8,64.17,778646.0

In [33]:
#32. Filter students whose assignment score lies between 70 and 90.

df[df["assignment_score"].between(70,90)]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0
6,1007,Student_7,Male,Mumbai,2024-02-22,Data Analytics,Weekend,120,112,93,89,94,3.2,29,Placed,6,93.33,707137.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.3,14,Placed,6,90.83,1053790.0
14,1015,Student_15,Female,Delhi,2024-05-30,Data Analytics,Weekend,120,88,93,71,64,3.9,29,Placed,7,73.33,1128411.0
20,1021,Student_21,Female,Pune,2024-07-02,AI & ML,Weekday,120,102,45,83,89,3.7,23,Not Placed,6,85.00,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
484,1485,Student_485,Male,Delhi,2024-07-13,Data Science,Weekend,120,65,69,90,65,3.8,35,Not Placed,8,54.17,NaN
491,1492,Student_492,Male,Chennai,2024-08-13,Data Analytics,Weekday,120,74,87,81,80,2.3,15,Placed,8,61.67,1155121.0
493,1494,Student_494,Female,Delhi,2024-12-20,Generative AI,Weekday,120,94,75,88,88,3.9,36,Placed,8,78.33,596618.0
494,1495,Student_495,Male,Pune,2024-12-07,AI & ML,Weekend,120,61,69,77,52,4.1,9,Placed,8,50.83,867354.0
499,1500,Student_500,Female,Pune,2024-06-06,AI & ML,Weekday,120,73,57,79,78,3.8,21,Placed,7,60.83,1115331.0

In [34]:
#33. Filter students whose learning hours lie between 10 and 25

df[df["learning_hours"].between(10,25)]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.3,14,Placed,6,90.83,1053790.0
8,1009,Student_9,Male,Mumbai,2024-05-05,AI & ML,Weekend,120,83,75,61,96,2.6,19,Placed,8,69.17,502210.0
10,1011,Student_11,Male,Chennai,2024-02-12,Data Science,Weekday,120,102,53,48,61,4.6,25,Not Placed,7,85.00,NaN
18,1019,Student_19,Female,Pune,2024-01-08,Data Science,Weekend,120,115,74,58,78,2.9,11,Placed,8,95.83,1000399.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
479,1480,Student_480,Female,Mumbai,2024-01-02,Data Science,Weekday,120,89,58,92,51,4.2,17,Placed,7,74.17,686486.0
485,1486,Student_486,Female,Mumbai,2024-04-28,AI & ML,Weekday,120,62,97,94,87,2.5,22,Placed,5,51.67,716704.0
491,1492,Student_492,Male,Chennai,2024-08-13,Data Analytics,Weekday,120,74,87,81,80,2.3,15,Placed,8,61.67,1155121.0
495,1496,Student_496,Male,Hyderabad,2024-12-29,Data Science,Weekday,120,86,94,97,57,3.1,14,Placed,7,71.67,572544.0
499,1500,Student_500,Female,Pune,2024-06-06,AI & ML,Weekday,120,73,57,79,78,3.8,21,Placed,7,60.83,1115331.0

In [35]:
#34. Create a new column total_score as the sum of quiz, assignment, and project scores

df["total_score"] = df["avg_quiz_score"] + df["assignment_score"] + df["project_score"]

In [36]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0,221
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN,233
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0,194
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN,236
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0,146

In [37]:
#35. Create a new column attendance_flag based on attendance percentage

def attendance_label(x):
    if x >= 75:
        return "Good"
    else:
        return "Poor"

df["attendance_flag"] = df["attendance_pct"].apply(attendance_label)

In [38]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0,221,Good
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN,233,Good
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0,194,Poor
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN,236,Poor
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0,146,Good

In [39]:
#36. Create a new column learning_intensity based on learning hours.

def learning_hrs(x):
    if x > 20:
        return "High"
    elif x >= 10:
        return "Medium"
    else:
        return "Low"

df["learning_intensity"] = df["learning_hours"].apply(learning_hrs)

In [40]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,66,3.7,6,Placed,7,90.00,738963.0,221,Good,Low
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,83,4.5,33,Not Placed,8,91.67,NaN,233,Good,High
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,73,3.6,8,Placed,5,60.83,501904.0,194,Poor,Low
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,81,2.7,5,Not Placed,8,59.17,NaN,236,Poor,Low
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,50,2.1,23,Placed,9,84.17,970105.0,146,Good,High

In [41]:
#37. Classify students based on total_score using apply().

def student_performance(x):
    if x >= 250:
        return "Excellent"
    elif x >= 200:
        return "Good"
    else:
        return "Poor"

df["performance"] = df["total_score"].apply(student_performance)

In [42]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,performance
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,3.7,6,Placed,7,90.00,738963.0,221,Good,Low,Good
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,4.5,33,Not Placed,8,91.67,NaN,233,Good,High,Good
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,3.6,8,Placed,5,60.83,501904.0,194,Poor,Low,Poor
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,2.7,5,Not Placed,8,59.17,NaN,236,Poor,Low,Good
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,2.1,23,Placed,9,84.17,970105.0,146,Good,High,Poor

In [43]:
#38. Create a placement eligibility column using apply().

def eligible(x):
    if x["attendance_pct"] >= 75 and x["total_score"] >= 200:
        return "Eligible"
    else:
        return "Not Eligible"

df["placement_eligibilty"] = df.apply(eligible, axis=1)

In [44]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,performance,placement_eligibilty
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,6,Placed,7,90.00,738963.0,221,Good,Low,Good,Eligible
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,33,Not Placed,8,91.67,NaN,233,Good,High,Good,Eligible
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,8,Placed,5,60.83,501904.0,194,Poor,Low,Poor,Not Eligible
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,5,Not Placed,8,59.17,NaN,236,Poor,Low,Good,Not Eligible
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,23,Placed,9,84.17,970105.0,146,Good,High,Poor,Not Eligible

In [45]:
#39. Map placement_status values to numerical values.

placement = {"Placed" : 1, "Not Placed" : 0}

df["placement_numeric_status"] = df["placement_status"].map(placement)

In [46]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,performance,placement_eligibilty,placement_numeric_status
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,Placed,7,90.00,738963.0,221,Good,Low,Good,Eligible,1
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,Not Placed,8,91.67,NaN,233,Good,High,Good,Eligible,0
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,Placed,5,60.83,501904.0,194,Poor,Low,Poor,Not Eligible,1
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,Not Placed,8,59.17,NaN,236,Poor,Low,Good,Not Eligible,0
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,Placed,9,84.17,970105.0,146,Good,High,Poor,Not Eligible,1

In [47]:
#40. Map batch_type values to abbreviated codes.

code = {"weekend" : "WE", "weekday" : "WD"}

df["batch_code"] = df["batch_type"].map(code)

In [48]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,performance,placement_eligibilty,placement_numeric_status,batch_code
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,7,90.00,738963.0,221,Good,Low,Good,Eligible,1,NaN
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,8,91.67,NaN,233,Good,High,Good,Eligible,0,NaN
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,5,60.83,501904.0,194,Poor,Low,Poor,Not Eligible,1,NaN
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,8,59.17,NaN,236,Poor,Low,Good,Not Eligible,0,NaN
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,9,84.17,970105.0,146,Good,High,Poor,Not Eligible,1,NaN

In [49]:
#41. Map gender values to single-letter codes.

gender = {"Male" : "M", "Female":"F"}

df["gender_code"] = df["gender"].map(gender)

In [50]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,performance,placement_eligibilty,placement_numeric_status,batch_code,gender_code
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,90.00,738963.0,221,Good,Low,Good,Eligible,1,NaN,M
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,91.67,NaN,233,Good,High,Good,Eligible,0,NaN,F
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,60.83,501904.0,194,Poor,Low,Poor,Not Eligible,1,NaN,M
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,59.17,NaN,236,Poor,Low,Good,Not Eligible,0,NaN,M
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,84.17,970105.0,146,Good,High,Poor,Not Eligible,1,NaN,M

In [51]:
#42. Count students under each learning_intensity category.

df["learning_intensity"].value_counts()

learning_intensity
High      279
Medium    149
Low        72
Name: count, dtype: int64

In [52]:
#43. Calculate the percentage of placement-eligible students.

print(df['placement_eligibilty'].value_counts()[1]/len(df) * 100)

34.2

C:\Users\Dell\AppData\Local\Temp\ipykernel_8840\1097179187.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df['placement_eligibilty'].value_counts()[1]/len(df) * 100)

In [100]:
#44. Identify the city with the highest number of placed students.

df['city'].value_counts().sort_values(ascending=False).head(1)

city
Hyderabad    99
Name: count, dtype: int64

In [54]:
#45. Compare average total_score for placed and not placed students

df.groupby('placement_status')['total_score'].mean()

placement_status
Not Placed    214.952096
Placed        217.606607
Name: total_score, dtype: float64

In [55]:
#46. Identify the top 5 students based on total_score.

df.sort_values(["total_score"], ascending = False).head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,performance,placement_eligibilty,placement_numeric_status,batch_code,gender_code
475,1476,Student_476,Female,Chennai,2024-02-05,Data Analytics,Weekday,120,97,99,...,80.83,855839.0,292,Good,High,Excellent,Eligible,1,NaN,F
178,1179,Student_179,Male,Mumbai,2024-04-22,AI & ML,Weekday,120,82,99,...,68.33,NaN,284,Poor,High,Excellent,Not Eligible,0,NaN,M
183,1184,Student_184,Male,Mumbai,2024-05-21,Data Science,Weekend,120,112,94,...,93.33,728556.0,279,Good,Low,Excellent,Eligible,1,NaN,M
144,1145,Student_145,Female,Mumbai,2024-05-31,Data Science,Weekend,120,105,92,...,87.50,733797.0,278,Good,High,Excellent,Eligible,1,NaN,F
263,1264,Student_264,Male,Delhi,2024-05-13,Generative AI,Weekday,120,101,97,...,84.17,301515.0,278,Good,Low,Excellent,Eligible,1,NaN,M

In [56]:
#1. Group the data by course and calculate the average attendance percentage

df.groupby("course")["attendance_pct"].mean()

course
AI & ML           73.066960
Data Analytics    73.146713
Data Science      73.632578
Generative AI     74.126635
Name: attendance_pct, dtype: float64

In [57]:
#2. Group the data by city and count the number of students in each city.

df.groupby("city")["student_id"].count()

city
Bangalore    81
Chennai      73
Delhi        67
Hyderabad    99
Mumbai       93
Pune         87
Name: student_id, dtype: int64

In [58]:
#3. Group the data by batch_type and calculate the average quiz score.

df.groupby("batch_type")["avg_quiz_score"].mean()

batch_type
Weekday    69.483193
Weekend    69.591603
Name: avg_quiz_score, dtype: float64

In [59]:
#4. Group the data by placement_status and calculate the average total_score.

df.groupby("placement_status")["total_score"].mean()

placement_status
Not Placed    214.952096
Placed        217.606607
Name: total_score, dtype: float64

In [60]:
#5. Group the data by course and city and calculate the number of students in each combination.

df.groupby(["course","city"])["student_id"].count()

course          city
AI & ML         Bangalore    20
                Chennai      14
                Delhi        16
                Hyderabad    19
                Mumbai       30
                Pune         26
Data Analytics  Bangalore    25
                Chennai      18
                Delhi        21
                Hyderabad    33
                Mumbai       26
                Pune         20
Data Science    Bangalore    19
                Chennai      24
                Delhi        12
                Hyderabad    31
                Mumbai       20
                Pune         22
Generative AI   Bangalore    17
                Chennai      17
                Delhi        18
                Hyderabad    16
                Mumbai       17
                Pune         19
Name: student_id, dtype: int64

In [61]:
#6. Group the data by course and calculate the maximum, minimum, and average project score.

df.groupby("course")["project_score"].agg(["max","min","mean"])

                max  min       mean
course
AI & ML          99   50  74.136000
Data Analytics   99   50  75.839161
Data Science     99   50  75.992188
Generative AI    98   50  75.221154

In [62]:
#7. Group the data by city and calculate total and average learning hours.

df.groupby("city")["learning_hours"].agg(["sum","mean"])

            sum       mean
city
Bangalore  1851  22.851852
Chennai    1557  21.328767
Delhi      1473  21.985075
Hyderabad  2190  22.121212
Mumbai     2106  22.645161
Pune       1886  21.678161

In [63]:
#8. Group the data by course and placement_status and count students.

df.groupby("course")["placement_status"].count()

course
AI & ML           125
Data Analytics    143
Data Science      128
Generative AI     104
Name: placement_status, dtype: int64

In [64]:
#9. Filter grouped results to display only courses with average attendance percentage greater than 80.

avg_attendance_pct = df.groupby("course")["attendance_pct"].mean()

In [65]:
avg_attendance_pct[avg_attendance_pct > 80]

Series([], Name: attendance_pct, dtype: float64)

In [66]:
#10. Filter grouped results to show only cities with more than 50 students.

count_students = df.groupby("city")["student_id"].count()

In [67]:
count_students[count_students > 50]

city
Bangalore    81
Chennai      73
Delhi        67
Hyderabad    99
Mumbai       93
Pune         87
Name: student_id, dtype: int64

In [68]:
#11. Perform multiple aggregations on course to calculate average quiz score, average assignment score, and average project score.

df.groupby("course")[["avg_quiz_score","assignment_score","project_score"]].mean()

                avg_quiz_score  assignment_score  project_score
course
AI & ML              69.256000         71.544000      74.136000
Data Analytics       69.041958         71.545455      75.839161
Data Science         69.960938         72.656250      75.992188
Generative AI        70.048077         71.673077      75.221154

In [69]:
#12. Perform named aggregations on course to calculate average_attendance, max_project_score, and mean_total_score

df.groupby("course").agg(AverageAttendance=("attendance_pct","mean"),
                         MaxProjectScore=("project_score","max"),
                         MeanTotalScore=("total_score","mean"))

                AverageAttendance  MaxProjectScore  MeanTotalScore
course
AI & ML                 73.066960               99      214.936000
Data Analytics          73.146713               99      216.426573
Data Science            73.632578               99      218.609375
Generative AI           74.126635               98      216.942308

In [70]:
#13. Perform named aggregations on city to calculate total_students, placed_students, and average_salary

df.groupby("city").agg(TotalStudents=("student_id","count"),
                       PlacedStudents=("placement_numeric_status","sum"),
                       AverageSalary=("salary_offered","mean"))

           TotalStudents  PlacedStudents  AverageSalary
city
Bangalore             81              61  806146.393443
Chennai               73              44  823148.090909
Delhi                 67              36  756018.277778
Hyderabad             99              69  703994.405797
Mumbai                93              63  764211.809524
Pune                  87              60  779828.883333

In [71]:
df["enrollment_date"] = pd.to_datetime(df["enrollment_date"])

In [72]:
#14. Extract year from enrollment_date and add it as a new column.

df["Enrollment_year"]=df["enrollment_date"].dt.year
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,salary_offered,total_score,attendance_flag,learning_intensity,performance,placement_eligibilty,placement_numeric_status,batch_code,gender_code,Enrollment_year
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,738963.0,221,Good,Low,Good,Eligible,1,NaN,M,2024
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,NaN,233,Good,High,Good,Eligible,0,NaN,F,2024
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,501904.0,194,Poor,Low,Poor,Not Eligible,1,NaN,M,2024
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,NaN,236,Poor,Low,Good,Not Eligible,0,NaN,M,2024
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,970105.0,146,Good,High,Poor,Not Eligible,1,NaN,M,2024

In [73]:
#15. Extract month number from enrollment_date and add it as a new column.

df["Enrollment_month"] = df["enrollment_date"].dt.month
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,total_score,attendance_flag,learning_intensity,performance,placement_eligibilty,placement_numeric_status,batch_code,gender_code,Enrollment_year,Enrollment_month
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,221,Good,Low,Good,Eligible,1,NaN,M,2024,11
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,233,Good,High,Good,Eligible,0,NaN,F,2024,9
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,194,Poor,Low,Poor,Not Eligible,1,NaN,M,2024,12
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,236,Poor,Low,Good,Not Eligible,0,NaN,M,2024,3
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,146,Good,High,Poor,Not Eligible,1,NaN,M,2024,2

In [74]:
#16. Extract month name from enrollment_date and add it as a new column.

df["MonthName"] = df["enrollment_date"].dt.month_name()
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,attendance_flag,learning_intensity,performance,placement_eligibilty,placement_numeric_status,batch_code,gender_code,Enrollment_year,Enrollment_month,MonthName
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,Good,Low,Good,Eligible,1,NaN,M,2024,11,November
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,Good,High,Good,Eligible,0,NaN,F,2024,9,September
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,Poor,Low,Poor,Not Eligible,1,NaN,M,2024,12,December
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,Poor,Low,Good,Not Eligible,0,NaN,M,2024,3,March
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,Good,High,Poor,Not Eligible,1,NaN,M,2024,2,February

In [75]:
#17. Extract day name from enrollment_date and add it as a new column.

df["DayName"] = df["enrollment_date"].dt.day_name()
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,learning_intensity,performance,placement_eligibilty,placement_numeric_status,batch_code,gender_code,Enrollment_year,Enrollment_month,MonthName,DayName
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,Low,Good,Eligible,1,NaN,M,2024,11,November,Monday
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,High,Good,Eligible,0,NaN,F,2024,9,September,Sunday
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,Low,Poor,Not Eligible,1,NaN,M,2024,12,December,Thursday
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,Low,Good,Not Eligible,0,NaN,M,2024,3,March,Saturday
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,High,Poor,Not Eligible,1,NaN,M,2024,2,February,Saturday

In [76]:
#18. Extract quarter from enrollment_date and add it as a new column.

df["Quarter"] = df["enrollment_date"].dt.quarter
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,performance,placement_eligibilty,placement_numeric_status,batch_code,gender_code,Enrollment_year,Enrollment_month,MonthName,DayName,Quarter
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,Good,Eligible,1,NaN,M,2024,11,November,Monday,4
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,Good,Eligible,0,NaN,F,2024,9,September,Sunday,3
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,Poor,Not Eligible,1,NaN,M,2024,12,December,Thursday,4
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,Good,Not Eligible,0,NaN,M,2024,3,March,Saturday,1
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,Poor,Not Eligible,1,NaN,M,2024,2,February,Saturday,1

In [77]:
#19. Group the data by year and calculate the number of student enrollments.

df.groupby("Enrollment_year")["student_id"].count()

Enrollment_year
2024    500
Name: student_id, dtype: int64

In [78]:
#20. Group the data by month name and calculate average attendance percentage.

df.groupby("MonthName")["attendance_pct"].mean()

MonthName
April        71.406250
August       69.603333
December     73.603243
February     71.824054
January      72.907959
July         76.972667
June         72.479268
March        72.970000
May          74.072500
November     73.775714
October      78.529412
September    73.257273
Name: attendance_pct, dtype: float64

In [79]:
#21. Group the data by quarter and calculate average total_score.

df.groupby("Quarter")["total_score"].mean()

Quarter
1    214.296000
2    218.082707
3    217.533333
4    216.985401
Name: total_score, dtype: float64

In [80]:
#22. Group the data by day name and count the number of enrollments.

df.groupby("DayName")["student_id"].count()

DayName
Friday       74
Monday       78
Saturday     85
Sunday       74
Thursday     76
Tuesday      60
Wednesday    53
Name: student_id, dtype: int64

In [81]:
#23. Identify the month with the highest number of enrollments.

df.groupby("MonthName")["student_id"].count().sort_values(ascending=False).head(1)

MonthName
October    51
Name: student_id, dtype: int64

In [82]:
#24. Identify the quarter with the highest average project score.

df.groupby("Quarter")["project_score"].mean().sort_values(ascending=False).head(1)

Quarter
2    76.045113
Name: project_score, dtype: float64

In [83]:
#25. Group the data by year and course and calculate average quiz score.

df.groupby(["Enrollment_year","course"])["avg_quiz_score"].mean()

Enrollment_year  course
2024             AI & ML           69.256000
                 Data Analytics    69.041958
                 Data Science      69.960938
                 Generative AI     70.048077
Name: avg_quiz_score, dtype: float64

In [84]:
#26. Group the data by month name and placement_status and count students.

df.groupby(["MonthName","placement_status"])["student_id"].count()

MonthName  placement_status
April      Not Placed          15
           Placed              33
August     Not Placed          16
           Placed              26
December   Not Placed          16
           Placed              21
February   Not Placed          10
           Placed              27
January    Not Placed          19
           Placed              30
July       Not Placed          10
           Placed              20
June       Not Placed          14
           Placed              27
March      Not Placed          12
           Placed              27
May        Not Placed          13
           Placed              31
November   Not Placed          18
           Placed              31
October    Not Placed          16
           Placed              35
September  Not Placed           8
           Placed              25
Name: student_id, dtype: int64

In [85]:
#27. Group the data by city and year and calculate placement count.

df[df["placement_numeric_status"] == 1].groupby(["city", "Enrollment_year"])["student_id"].count()

city       Enrollment_year
Bangalore  2024               61
Chennai    2024               44
Delhi      2024               36
Hyderabad  2024               69
Mumbai     2024               63
Pune       2024               60
Name: student_id, dtype: int64

In [86]:
#28. Filter grouped year-wise enrollments to display only years with more than 100 enrollments.

year_wise_enrollments = df.groupby("Enrollment_year")["student_id"].count()

In [87]:
year_wise_enrollments[year_wise_enrollments > 100]

Enrollment_year
2024    500
Name: student_id, dtype: int64

In [88]:
#29. Filter grouped course-wise performance to show only courses with average total_score above 220.

course_avg_score = df.groupby("course")["total_score"].mean()

In [89]:
course_avg_score[course_avg_score > 220]

Series([], Name: total_score, dtype: float64)

In [90]:
#30. Compare average attendance percentage across quarters.

df.groupby("Quarter")["attendance_pct"].mean()

Quarter
1    72.606480
2    72.619098
3    72.857238
4    75.498759
Name: attendance_pct, dtype: float64

In [91]:
#31. Calculate average salary offered per course using groupby.

df.groupby("course")["salary_offered"].mean()

course
AI & ML           785944.506494
Data Analytics    788028.545455
Data Science      781899.318182
Generative AI     706972.492754
Name: salary_offered, dtype: float64

In [92]:
#32. Calculate average salary offered per city using groupby.

df.groupby("city")["salary_offered"].mean()

city
Bangalore    806146.393443
Chennai      823148.090909
Delhi        756018.277778
Hyderabad    703994.405797
Mumbai       764211.809524
Pune         779828.883333
Name: salary_offered, dtype: float64

In [93]:
#33. Identify top 3 cities based on average salary offered.

df.groupby("city")["salary_offered"].mean().sort_values(ascending=False).head(3)

city
Chennai      823148.090909
Bangalore    806146.393443
Pune         779828.883333
Name: salary_offered, dtype: float64

In [94]:
#34. Identify the course with the highest placement rate using groupby analysis.

df.groupby("course")["placement_numeric_status"].mean().sort_values(ascending=False).head(1)

course
Data Analytics    0.692308
Name: placement_numeric_status, dtype: float64

In [95]:
#35. Group the data by batch_type and quarter to analyze attendance patterns.

df.groupby(["batch_type", "Quarter"])["attendance_pct"].mean()

batch_type  Quarter
Weekday     1          71.958772
            2          71.835652
            3          74.947917
            4          73.671719
Weekend     1          73.149412
            2          73.463750
            3          71.096667
            4          77.100548
Name: attendance_pct, dtype: float64

In [96]:
#36. Group the data by month name and course to analyze enrollment distribution.

df.groupby(["MonthName", "course"])["student_id"].count()

MonthName  course
April      AI & ML            6
           Data Analytics    17
           Data Science      13
           Generative AI     12
August     AI & ML           12
           Data Analytics    15
           Data Science       6
           Generative AI      9
December   AI & ML            9
           Data Analytics    11
           Data Science      11
           Generative AI      6
February   AI & ML           10
           Data Analytics    10
           Data Science      11
           Generative AI      6
January    AI & ML           14
           Data Analytics    15
           Data Science      11
           Generative AI      9
July       AI & ML           10
           Data Analytics     5
           Data Science       8
           Generative AI      7
June       AI & ML            8
           Data Analytics    13
           Data Science      13
           Generative AI      7
March      AI & ML           13
           Data Analytics    11
           Data Science       5
           Generative AI     10
May        AI & ML            8
           Data Analytics    12
           Data Science      15
           Generative AI      9
November   AI & ML           15
           Data Analytics    10
           Data Science      11
           Generative AI     13
October    AI & ML           14
           Data Analytics    11
           Data Science      17
           Generative AI      9
September  AI & ML            6
           Data Analytics    13
           Data Science       7
           Generative AI      7
Name: student_id, dtype: int64

In [97]:
#37. Identify days of the week with maximum enrollments.

df.groupby("DayName")["student_id"].count().sort_values(ascending=False).head(1)

DayName
Saturday    85
Name: student_id, dtype: int64

In [98]:
#38. Analyze placement status distribution across quarters.

df.groupby(["Quarter", "placement_numeric_status"])["student_id"].count()

Quarter  placement_numeric_status
1        0                           41
         1                           84
2        0                           42
         1                           91
3        0                           34
         1                           71
4        0                           50
         1                           87
Name: student_id, dtype: int64